Les architectures modernes sont capables de faire plusieurs opérations
simultanément de manière quasi-transparente pour le programmeur:
- avec l'exécution out-of-order des instructions du processeur
- en exécutant plusieurs flots d'instruction simultanément pour
  recouvrir les temps d'accès à la RAM ("l'hyperthreading" pour Intel)
- en faisant des calculs vectoriels (là les compilateurs ont encore
  des progrès à faire)

Ce parallélisme automatique est loin de refleter tout le potentiel
parallèle de la plupart des applications.  Les compilateurs ne sont
pas capable de l'extraire de manière automatique, même pour des
langages "simples" comme Fortran.

Le programmeur doit donc faire le travail d'expliquer au compilateur
et au matériel comment faire plusieurs choses à la fois.

** Démarrer des treads en Rust

#+INCLUDE: Codeparallelisme/startRust.rs src rust

La compilation et le lancement
#+BEGIN_SRC sh :exports both
rustc -O Codeparallelisme/startRust.rs -o bin/startRust
bin/startRust | ts -s
#+END_SRC

#+RESULTS:
| 00:00:00 | Hello | world | from | 6 |
| 00:00:00 | Hello | world | from | 0 |
| 00:00:00 | Hello | world | from | 3 |
| 00:00:00 | Hello | world | from | 7 |
| 00:00:00 | Hello | world | from | 2 |
| 00:00:00 | Hello | world | from | 5 |
| 00:00:00 | Hello | world | from | 4 |
| 00:00:00 | Hello | world | from | 1 |
| 00:00:00 | Hello | world | from | 8 |
| 00:00:00 | Hello | world | from | 9 |


